# Advanced SQL query syntax part 2

**Author:** 'Felipe Millacura'
    
**Date:** '21th March 2021'

### Learning Objectives

* Learn how `subqueries` work and how to use them
* Understand how to `join` tables in a many-to-many relationship
* See how `join`s combine with the other parts of the query syntax.
* export files to CSV and XLSX format

## The dataset

For learning purposes we will start this lesson by working with the previously used `zoo` database

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///data/zoo.sqlite

In [3]:
%%sql

SELECT * 
FROM keepers

 * sqlite:///data/zoo.sqlite
Done.

[(1, 'Tony'), (2, 'Yoshi'), (3, 'Anne'), (4, 'Jerome')]

In [4]:
%%sql

SELECT *
FROM animals

 * sqlite:///data/zoo.sqlite
Done.

[(1, 'Leo', 12, 'Lion', 2),
 (2, 'Tony', 8, 'Tiger', 2),
 (3, 'Matilda', 6, 'Cow', 1),
 (4, 'Bernice', 12, 'Bear', 3),
 (5, 'Gerry', 1, 'Goldfish', None),
 (6, 'Zoe', 3, 'Zebra', 1),
 (7, 'Ernest', 4, 'Snake', 2),
 (8, 'Kim', 6, 'Kangaroo', None)]

In [5]:
%%sql

SELECT * 
FROM diets

 * sqlite:///data/zoo.sqlite
Done.

[(1, 'herbivore'), (2, 'carnivore'), (3, 'omnivore'), (4, 'tofu')]

## Subqueries

Sometimes we would like to use a value produced by one query in another. This sounds abstract, but it’s actually pretty common! As an example, consider this problem:

> “Find all animals with `diet_id = 2` (carnivore)  who have over the zoo-wide average age.”

We might think a straightforward way to do this is:

In [6]:
%%sql

SELECT *
FROM animals
WHERE diet_id = 2 AND age > AVG(age)

 * sqlite:///data/zoo.sqlite
(sqlite3.OperationalError) misuse of aggregate function AVG()
[SQL: SELECT * FROM animals
WHERE diet_id = 2 AND age > AVG(age)]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

but we get an error `ERROR:  sqlite3.OperationalError) misuse of aggregate function AVG()`

This because aggregate functions are not allowed in `WHERE`!

In fact, we need to use a **subquery** here. This is just *one query embedded inside another*

In [7]:
%%sql

SELECT *
FROM animals
WHERE diet_id = 2 AND age > (SELECT AVG(age) FROM animals)

 * sqlite:///data/zoo.sqlite
Done.

[(1, 'Leo', 12, 'Lion', 2), (2, 'Tony', 8, 'Tiger', 2)]

If it helps, we can think of *building this query up* in two steps. First, we write what we want to achieve using a fake name ‘average_age’:

In [12]:
%%sql

SELECT * 
FROM animals WHERE diet_id = 2 AND age > (SELECT AVG(age) 
FROM animals)

 * sqlite:///data/zoo.sqlite
Done.

[(1, 'Leo', 12, 'Lion', 2), (2, 'Tony', 8, 'Tiger', 2)]

We know we need to use a subquery to get `average_age`, as it involves an aggregate function. So let’s write the subquery:

In [11]:
%%sql

SELECT AVG(age) 
FROM animals

 * sqlite:///data/zoo.sqlite
Done.

[(6.5,)]

Now wherever we see `average_age` in the first query, we replace it with the subquery in parentheses

In [13]:
%%sql
SELECT * 
FROM animals WHERE diet_id = 2 AND age > (SELECT AVG(age) FROM animals)

 * sqlite:///data/zoo.sqlite
Done.

[(1, 'Leo', 12, 'Lion', 2), (2, 'Tony', 8, 'Tiger', 2)]

* Subqueries can be used in `SELECT`, `WHERE`, and `FROM` clauses. 
* In `FROM` clauses they create "derived" tables.
* `ORDER BY` phrases cannot be used within subqueries.
* Subqueries in `SELECT`/`WHERE` clauses that return more than one row must be used with operators that handle multiple values, i.e. `IN` or they'll be limited to outputting just 1 row.

## Joins in many-to-many relationships

let’s see how to use joins to extract data from tables linked by a `many-to-many` relationship. Remember we have an extra join table in a `many-to-many` table.

If you remember in the `zoo` database, we had a `many-to-many` relationship between animals and keepers, i.e.

> ‘Each animal is cared for by many keepers, and each keeper cares for many animals’. 

The join table is called `care_schedule`. Each record in `care_schedule` tells us which keeper is looking after which animal, on which day.<br>

![](images/Many-to-Many-Zoo.png)

In order to join `animals` to `keepers` we have to go in *two hops*: first, a join from `animals` to `care_schedule`; and second, a join from `care_schedule` to `keepers`. 

Let's write the query and then describe it step by step. Don't be put off, this looks complicated, but think of building it up bit by bit...

In [30]:
%%sql

SELECT a.name AS animal_name, a.age, a.species, a.diet_id, cs.day, k.name AS name_keeper
FROM (animals AS a INNER JOIN care_schedule AS cs ON a.id = cs.animal_id)
INNER JOIN keepers AS k
ON cs.keeper_id = k.id

 * sqlite:///data/zoo.sqlite
Done.

[('Leo', 12, 'Lion', 2, 'Monday', 'Yoshi'),
 ('Leo', 12, 'Lion', 2, 'Tuesday', 'Tony'),
 ('Leo', 12, 'Lion', 2, 'Wednesday', 'Anne'),
 ('Leo', 12, 'Lion', 2, 'Thursday', 'Jerome'),
 ('Leo', 12, 'Lion', 2, 'Friday', 'Yoshi'),
 ('Leo', 12, 'Lion', 2, 'Saturday', 'Tony'),
 ('Leo', 12, 'Lion', 2, 'Sunday', 'Jerome'),
 ('Tony', 8, 'Tiger', 2, 'Monday', 'Anne'),
 ('Tony', 8, 'Tiger', 2, 'Tuesday', 'Jerome'),
 ('Tony', 8, 'Tiger', 2, 'Wednesday', 'Anne'),
 ('Tony', 8, 'Tiger', 2, 'Thursday', 'Tony'),
 ('Tony', 8, 'Tiger', 2, 'Friday', 'Jerome'),
 ('Tony', 8, 'Tiger', 2, 'Saturday', 'Yoshi'),
 ('Tony', 8, 'Tiger', 2, 'Sunday', 'Anne'),
 ('Matilda', 6, 'Cow', 1, 'Monday', 'Tony'),
 ('Matilda', 6, 'Cow', 1, 'Tuesday', 'Jerome'),
 ('Matilda', 6, 'Cow', 1, 'Wednesday', 'Jerome'),
 ('Matilda', 6, 'Cow', 1, 'Thursday', 'Tony'),
 ('Matilda', 6, 'Cow', 1, 'Friday', 'Anne'),
 ('Matilda', 6, 'Cow', 1, 'Saturday', 'Jerome'),
 ('Matilda', 6, 'Cow', 1, 'Sunday', 'Yoshi'),
 ('Bernice', 12, 'Bear', 3, 'Monday', 'Jerome'),
 ('Bernice', 12, 'Bear', 3, 'Tuesday', 'Yoshi'),
 ('Bernice', 12, 'Bear', 3, 'Wednesday', 'Anne'),
 ('Bernice', 12, 'Bear', 3, 'Thursday', 'Tony'),
 ('Bernice', 12, 'Bear', 3, 'Friday', 'Anne'),
 ('Bernice', 12, 'Bear', 3, 'Saturday', 'Jerome'),
 ('Bernice', 12, 'Bear', 3, 'Sunday', 'Yoshi'),
 ('Gerry', 1, 'Goldfish', None, 'Monday', 'Anne'),
 ('Gerry', 1, 'Goldfish', None, 'Tuesday', 'Tony'),
 ('Gerry', 1, 'Goldfish', None, 'Wednesday', 'Jerome'),
 ('Gerry', 1, 'Goldfish', None, 'Thursday', 'Yoshi'),
 ('Gerry', 1, 'Goldfish', None, 'Friday', 'Jerome'),
 ('Gerry', 1, 'Goldfish', None, 'Saturday', 'Anne'),
 ('Gerry', 1, 'Goldfish', None, 'Sunday', 'Tony'),
 ('Zoe', 3, 'Zebra', 1, 'Monday', 'Tony'),
 ('Zoe', 3, 'Zebra', 1, 'Tuesday', 'Yoshi'),
 ('Zoe', 3, 'Zebra', 1, 'Wednesday', 'Jerome'),
 ('Zoe', 3, 'Zebra', 1, 'Thursday', 'Anne'),
 ('Zoe', 3, 'Zebra', 1, 'Friday', 'Yoshi'),
 ('Zoe', 3, 'Zebra', 1, 'Saturday', 'Jerome'),
 ('Zoe', 3, 'Zebra', 1, 'Sunday', 'Tony'),
 ('Ernest', 4, 'Snake', 2, 'Monday', 'Yoshi'),
 ('Ernest', 4, 'Snake', 2, 'Tuesday', 'Anne'),
 ('Ernest', 4, 'Snake', 2, 'Wednesday', 'Tony'),
 ('Ernest', 4, 'Snake', 2, 'Thursday', 'Jerome'),
 ('Ernest', 4, 'Snake', 2, 'Friday', 'Jerome'),
 ('Ernest', 4, 'Snake', 2, 'Saturday', 'Anne'),
 ('Ernest', 4, 'Snake', 2, 'Sunday', 'Yoshi'),
 ('Kim', 6, 'Kangaroo', None, 'Monday', 'Tony'),
 ('Kim', 6, 'Kangaroo', None, 'Tuesday', 'Anne'),
 ('Kim', 6, 'Kangaroo', None, 'Wednesday', 'Tony'),
 ('Kim', 6, 'Kangaroo', None, 'Thursday', 'Jerome'),
 ('Kim', 6, 'Kangaroo', None, 'Friday', 'Anne'),
 ('Kim', 6, 'Kangaroo', None, 'Saturday', 'Yoshi'),
 ('Kim', 6, 'Kangaroo', None, 'Sunday', 'Yoshi')]

In [31]:
%%sql

SELECT a.name AS animal_name, cs.day, k.name AS keeper_name
FROM (animals AS a INNER JOIN care_schedule AS cs ON a.id = cs.animal_id)
INNER JOIN keepers AS k
ON cs.keeper_id = k.id
ORDER BY a.name, cs.day

 * sqlite:///data/zoo.sqlite
Done.

[('Bernice', 'Friday', 'Anne'),
 ('Bernice', 'Monday', 'Jerome'),
 ('Bernice', 'Saturday', 'Jerome'),
 ('Bernice', 'Sunday', 'Yoshi'),
 ('Bernice', 'Thursday', 'Tony'),
 ('Bernice', 'Tuesday', 'Yoshi'),
 ('Bernice', 'Wednesday', 'Anne'),
 ('Ernest', 'Friday', 'Jerome'),
 ('Ernest', 'Monday', 'Yoshi'),
 ('Ernest', 'Saturday', 'Anne'),
 ('Ernest', 'Sunday', 'Yoshi'),
 ('Ernest', 'Thursday', 'Jerome'),
 ('Ernest', 'Tuesday', 'Anne'),
 ('Ernest', 'Wednesday', 'Tony'),
 ('Gerry', 'Friday', 'Jerome'),
 ('Gerry', 'Monday', 'Anne'),
 ('Gerry', 'Saturday', 'Anne'),
 ('Gerry', 'Sunday', 'Tony'),
 ('Gerry', 'Thursday', 'Yoshi'),
 ('Gerry', 'Tuesday', 'Tony'),
 ('Gerry', 'Wednesday', 'Jerome'),
 ('Kim', 'Friday', 'Anne'),
 ('Kim', 'Monday', 'Tony'),
 ('Kim', 'Saturday', 'Yoshi'),
 ('Kim', 'Sunday', 'Yoshi'),
 ('Kim', 'Thursday', 'Jerome'),
 ('Kim', 'Tuesday', 'Anne'),
 ('Kim', 'Wednesday', 'Tony'),
 ('Leo', 'Friday', 'Yoshi'),
 ('Leo', 'Monday', 'Yoshi'),
 ('Leo', 'Saturday', 'Tony'),
 ('Leo', 'Sunday', 'Jerome'),
 ('Leo', 'Thursday', 'Jerome'),
 ('Leo', 'Tuesday', 'Tony'),
 ('Leo', 'Wednesday', 'Anne'),
 ('Matilda', 'Friday', 'Anne'),
 ('Matilda', 'Monday', 'Tony'),
 ('Matilda', 'Saturday', 'Jerome'),
 ('Matilda', 'Sunday', 'Yoshi'),
 ('Matilda', 'Thursday', 'Tony'),
 ('Matilda', 'Tuesday', 'Jerome'),
 ('Matilda', 'Wednesday', 'Jerome'),
 ('Tony', 'Friday', 'Jerome'),
 ('Tony', 'Monday', 'Anne'),
 ('Tony', 'Saturday', 'Yoshi'),
 ('Tony', 'Sunday', 'Anne'),
 ('Tony', 'Thursday', 'Tony'),
 ('Tony', 'Tuesday', 'Jerome'),
 ('Tony', 'Wednesday', 'Anne'),
 ('Zoe', 'Friday', 'Yoshi'),
 ('Zoe', 'Monday', 'Tony'),
 ('Zoe', 'Saturday', 'Jerome'),
 ('Zoe', 'Sunday', 'Tony'),
 ('Zoe', 'Thursday', 'Anne'),
 ('Zoe', 'Tuesday', 'Yoshi'),
 ('Zoe', 'Wednesday', 'Jerome')]

You see we have two `JOIN` operators. Here's one way to visualise this:

![](images/Multi-step-joins.png)

![](images/Multi-step-joins.png)

Think of the output table from `animals` to `care_schedule` being **further joined** to `keepers`, i.e. 

(`animals INNER JOIN care_schedule`) `INNER JOIN keepers`

The `INNER JOIN` in parentheses is executed first, and the output from it then `INNER JOIN`ed to `keepers`.

In [32]:
%%sql
SELECT a.name, care_schedule.day AS day_of_the_week
FROM animals AS a
INNER JOIN care_schedule
ON a.id = care_schedule.animal_id

 * sqlite:///data/zoo.sqlite
Done.

[('Leo', 'Monday'),
 ('Leo', 'Tuesday'),
 ('Leo', 'Wednesday'),
 ('Leo', 'Thursday'),
 ('Leo', 'Friday'),
 ('Leo', 'Saturday'),
 ('Leo', 'Sunday'),
 ('Tony', 'Monday'),
 ('Tony', 'Tuesday'),
 ('Tony', 'Wednesday'),
 ('Tony', 'Thursday'),
 ('Tony', 'Friday'),
 ('Tony', 'Saturday'),
 ('Tony', 'Sunday'),
 ('Matilda', 'Monday'),
 ('Matilda', 'Tuesday'),
 ('Matilda', 'Wednesday'),
 ('Matilda', 'Thursday'),
 ('Matilda', 'Friday'),
 ('Matilda', 'Saturday'),
 ('Matilda', 'Sunday'),
 ('Bernice', 'Monday'),
 ('Bernice', 'Tuesday'),
 ('Bernice', 'Wednesday'),
 ('Bernice', 'Thursday'),
 ('Bernice', 'Friday'),
 ('Bernice', 'Saturday'),
 ('Bernice', 'Sunday'),
 ('Gerry', 'Monday'),
 ('Gerry', 'Tuesday'),
 ('Gerry', 'Wednesday'),
 ('Gerry', 'Thursday'),
 ('Gerry', 'Friday'),
 ('Gerry', 'Saturday'),
 ('Gerry', 'Sunday'),
 ('Zoe', 'Monday'),
 ('Zoe', 'Tuesday'),
 ('Zoe', 'Wednesday'),
 ('Zoe', 'Thursday'),
 ('Zoe', 'Friday'),
 ('Zoe', 'Saturday'),
 ('Zoe', 'Sunday'),
 ('Ernest', 'Monday'),
 ('Ernest', 'Tuesday'),
 ('Ernest', 'Wednesday'),
 ('Ernest', 'Thursday'),
 ('Ernest', 'Friday'),
 ('Ernest', 'Saturday'),
 ('Ernest', 'Sunday'),
 ('Kim', 'Monday'),
 ('Kim', 'Tuesday'),
 ('Kim', 'Wednesday'),
 ('Kim', 'Thursday'),
 ('Kim', 'Friday'),
 ('Kim', 'Saturday'),
 ('Kim', 'Sunday')]

> How would we change the query above to show only the schedule for the keepers looking after Ernest the Snake?

**Hints**

* We need a `WHERE` clause.
* If we're limiting the results to those for Ernest, do we still need to order by animal name?

In [37]:
%%sql

SELECT a.name, cs.day, k.name AS keeper_name
FROM (animals AS a INNER JOIN care_schedule AS cs ON a.id = cs.animal_id)
INNER JOIN keepers AS k
ON cs.keeper_id = k.id
WHERE cs.day = 'Friday'
ORDER BY cs.day

 * sqlite:///data/zoo.sqlite
Done.

[('Leo', 'Friday', 'Yoshi'),
 ('Tony', 'Friday', 'Jerome'),
 ('Matilda', 'Friday', 'Anne'),
 ('Bernice', 'Friday', 'Anne'),
 ('Gerry', 'Friday', 'Jerome'),
 ('Zoe', 'Friday', 'Yoshi'),
 ('Ernest', 'Friday', 'Jerome'),
 ('Kim', 'Friday', 'Anne')]

## UNIONS

We won't go into them too much, but for awareness there is also a `UNION` operator. Basically, this allows you to 'stack' tables on top of each other, providing the tables have the same number of columns and the columns are of similar data types. They are different to `JOIN`s because you are stacking the columns rather than joining via a key. 

There is a function `UNION ALL`, which stacks tables exactly as they are, and `UNION`, which stacks but removes any duplicate entries which have appeared in both tables. 

You see can an example of `UNION` and `UNION ALL` [here](https://www.w3schools.com/sql/sql_union.asp).

## Useful check - duplicate joining keys 

A common error when `JOIN`ing tables is having (unintended) duplicates of the joining key in one of the tables, leading to duplications in the final `JOIN`ed table. A useful query to check this is:

```sql 
SELECT id, count(*) as id_count,  
FROM table  
GROUP BY id  
HAVING count(*) > 1  
```

In [39]:
%%sql

SELECT  id, count(*) as id_count 
FROM animals  
GROUP BY id  
HAVING count(*) > 1

 * sqlite:///data/zoo.sqlite
Done.

[]

## Useful tip - finding entries which don't match in a `JOIN`

Sometimes you may want to find those entries which are *not* matched in another table. There is a helpful way of doing this - `LEFT JOIN` to the table in which you want to find a match, but return only the rows where the join returns NULL i.e. there was no match found. For example the query below would return all the entries in the animals table that did not have a matching entry in the diet table.

In [42]:
%%sql

SELECT a.*
FROM animals AS a LEFT JOIN diets AS d
ON a.diet_id = d.id
WHERE d.id IS NULL

 * sqlite:///data/zoo.sqlite
Done.

[(5, 'Gerry', 1, 'Goldfish', None), (8, 'Kim', 6, 'Kangaroo', None)]

## Shorthand for GROUP BY & ORDER BY

In some SQL languages you can replace variable names with column numbers in `GROUP BY` and `ORDER BY`. It is better practice to fully write out column names, as it is easier to read and understand, but for awareness, you may see such syntax in other people's code. It's also undeniably useful for quick checks when you are dealing with many columns.

In [43]:
%%sql

SELECT a.name AS animal_name, cs.day, k.name AS keeper_name
FROM (animals AS a INNER JOIN care_schedule AS cs ON a.id = cs.animal_id)
INNER JOIN keepers AS k
ON cs.keeper_id = k.id
ORDER BY a.name, cs.day

 * sqlite:///data/zoo.sqlite
Done.

[('Bernice', 'Friday', 'Anne'),
 ('Bernice', 'Monday', 'Jerome'),
 ('Bernice', 'Saturday', 'Jerome'),
 ('Bernice', 'Sunday', 'Yoshi'),
 ('Bernice', 'Thursday', 'Tony'),
 ('Bernice', 'Tuesday', 'Yoshi'),
 ('Bernice', 'Wednesday', 'Anne'),
 ('Ernest', 'Friday', 'Jerome'),
 ('Ernest', 'Monday', 'Yoshi'),
 ('Ernest', 'Saturday', 'Anne'),
 ('Ernest', 'Sunday', 'Yoshi'),
 ('Ernest', 'Thursday', 'Jerome'),
 ('Ernest', 'Tuesday', 'Anne'),
 ('Ernest', 'Wednesday', 'Tony'),
 ('Gerry', 'Friday', 'Jerome'),
 ('Gerry', 'Monday', 'Anne'),
 ('Gerry', 'Saturday', 'Anne'),
 ('Gerry', 'Sunday', 'Tony'),
 ('Gerry', 'Thursday', 'Yoshi'),
 ('Gerry', 'Tuesday', 'Tony'),
 ('Gerry', 'Wednesday', 'Jerome'),
 ('Kim', 'Friday', 'Anne'),
 ('Kim', 'Monday', 'Tony'),
 ('Kim', 'Saturday', 'Yoshi'),
 ('Kim', 'Sunday', 'Yoshi'),
 ('Kim', 'Thursday', 'Jerome'),
 ('Kim', 'Tuesday', 'Anne'),
 ('Kim', 'Wednesday', 'Tony'),
 ('Leo', 'Friday', 'Yoshi'),
 ('Leo', 'Monday', 'Yoshi'),
 ('Leo', 'Saturday', 'Tony'),
 ('Leo', 'Sunday', 'Jerome'),
 ('Leo', 'Thursday', 'Jerome'),
 ('Leo', 'Tuesday', 'Tony'),
 ('Leo', 'Wednesday', 'Anne'),
 ('Matilda', 'Friday', 'Anne'),
 ('Matilda', 'Monday', 'Tony'),
 ('Matilda', 'Saturday', 'Jerome'),
 ('Matilda', 'Sunday', 'Yoshi'),
 ('Matilda', 'Thursday', 'Tony'),
 ('Matilda', 'Tuesday', 'Jerome'),
 ('Matilda', 'Wednesday', 'Jerome'),
 ('Tony', 'Friday', 'Jerome'),
 ('Tony', 'Monday', 'Anne'),
 ('Tony', 'Saturday', 'Yoshi'),
 ('Tony', 'Sunday', 'Anne'),
 ('Tony', 'Thursday', 'Tony'),
 ('Tony', 'Tuesday', 'Jerome'),
 ('Tony', 'Wednesday', 'Anne'),
 ('Zoe', 'Friday', 'Yoshi'),
 ('Zoe', 'Monday', 'Tony'),
 ('Zoe', 'Saturday', 'Jerome'),
 ('Zoe', 'Sunday', 'Tony'),
 ('Zoe', 'Thursday', 'Anne'),
 ('Zoe', 'Tuesday', 'Yoshi'),
 ('Zoe', 'Wednesday', 'Jerome')]

In [44]:
%%sql 

SELECT a.name AS animal_name, cs.day, k.name AS keeper_name
FROM (animals AS a INNER JOIN care_schedule AS cs
ON a.id = cs.animal_id)
INNER JOIN keepers AS k
ON cs.keeper_id = k.id
ORDER BY 1, 2

 * sqlite:///data/zoo.sqlite
Done.

[('Bernice', 'Friday', 'Anne'),
 ('Bernice', 'Monday', 'Jerome'),
 ('Bernice', 'Saturday', 'Jerome'),
 ('Bernice', 'Sunday', 'Yoshi'),
 ('Bernice', 'Thursday', 'Tony'),
 ('Bernice', 'Tuesday', 'Yoshi'),
 ('Bernice', 'Wednesday', 'Anne'),
 ('Ernest', 'Friday', 'Jerome'),
 ('Ernest', 'Monday', 'Yoshi'),
 ('Ernest', 'Saturday', 'Anne'),
 ('Ernest', 'Sunday', 'Yoshi'),
 ('Ernest', 'Thursday', 'Jerome'),
 ('Ernest', 'Tuesday', 'Anne'),
 ('Ernest', 'Wednesday', 'Tony'),
 ('Gerry', 'Friday', 'Jerome'),
 ('Gerry', 'Monday', 'Anne'),
 ('Gerry', 'Saturday', 'Anne'),
 ('Gerry', 'Sunday', 'Tony'),
 ('Gerry', 'Thursday', 'Yoshi'),
 ('Gerry', 'Tuesday', 'Tony'),
 ('Gerry', 'Wednesday', 'Jerome'),
 ('Kim', 'Friday', 'Anne'),
 ('Kim', 'Monday', 'Tony'),
 ('Kim', 'Saturday', 'Yoshi'),
 ('Kim', 'Sunday', 'Yoshi'),
 ('Kim', 'Thursday', 'Jerome'),
 ('Kim', 'Tuesday', 'Anne'),
 ('Kim', 'Wednesday', 'Tony'),
 ('Leo', 'Friday', 'Yoshi'),
 ('Leo', 'Monday', 'Yoshi'),
 ('Leo', 'Saturday', 'Tony'),
 ('Leo', 'Sunday', 'Jerome'),
 ('Leo', 'Thursday', 'Jerome'),
 ('Leo', 'Tuesday', 'Tony'),
 ('Leo', 'Wednesday', 'Anne'),
 ('Matilda', 'Friday', 'Anne'),
 ('Matilda', 'Monday', 'Tony'),
 ('Matilda', 'Saturday', 'Jerome'),
 ('Matilda', 'Sunday', 'Yoshi'),
 ('Matilda', 'Thursday', 'Tony'),
 ('Matilda', 'Tuesday', 'Jerome'),
 ('Matilda', 'Wednesday', 'Jerome'),
 ('Tony', 'Friday', 'Jerome'),
 ('Tony', 'Monday', 'Anne'),
 ('Tony', 'Saturday', 'Yoshi'),
 ('Tony', 'Sunday', 'Anne'),
 ('Tony', 'Thursday', 'Tony'),
 ('Tony', 'Tuesday', 'Jerome'),
 ('Tony', 'Wednesday', 'Anne'),
 ('Zoe', 'Friday', 'Yoshi'),
 ('Zoe', 'Monday', 'Tony'),
 ('Zoe', 'Saturday', 'Jerome'),
 ('Zoe', 'Sunday', 'Tony'),
 ('Zoe', 'Thursday', 'Anne'),
 ('Zoe', 'Tuesday', 'Yoshi'),
 ('Zoe', 'Wednesday', 'Jerome')]

### A wee reminder

* How do we join two tables A and B involved in a many-to-many relationship?<br>

<details>
<summary><b>Answer</b></summary><br>
We have to `JOIN` in two steps or 'hops', from table A to the join table, and then from the join table to table B.
</details>

### Additional Resources

* We don't have time to cover [self-joins](https://www.w3resource.com/sql/joins/perform-a-self-join.php) (i.e. a join of a table to itself), but they can be useful in certain circumstances!

## The dataset

We will query the Sakila DVD Rental database. The Sakila Database holds information about a company that rents movie DVDs and it's a 15 tables demo dataset for [PostgreSQL](https://www.postgresqltutorial.com/postgresql-sample-database/) 

**Note:** One quirk you may notice as you explore this "fake" database is that the rental dates are all from 2005 and 2006, while the payment dates are all from 2007. Don't worry about this. 


To assist you in the queries ahead, the **Entity Relationship Diagram (ERD)** for the DVD Rental database is provided below. You can find further information about ERDs [here](https://www.smartdraw.com/entity-relationship-diagram/)

![](images/database_dvd.png)

# Connecting to a PostgreSQL database

To connect `ipython-sql` to your database use the following format:

In [45]:
%sql  postgresql://postgres:trialpostgres@localhost/dvdrental

Let's see some examples with the Sakila DVD rental database. Step by step would be something like this:

First lets join the `city` and `country` tables

In [46]:
%%sql

SELECT city_id, city, country
FROM city AS ci
INNER JOIN country AS co
ON ci.country_id = co.country_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[(251, 'Kabul', 'Afghanistan'),
 (59, 'Batna', 'Algeria'),
 (63, 'Bchar', 'Algeria'),
 (483, 'Skikda', 'Algeria'),
 (516, 'Tafuna', 'American Samoa'),
 (67, 'Benguela', 'Angola'),
 (360, 'Namibe', 'Angola'),
 (493, 'South Hill', 'Anguilla'),
 (20, 'Almirante Brown', 'Argentina'),
 (43, 'Avellaneda', 'Argentina')]

The `address` to `city` join would be:

In [47]:
%%sql

SELECT address_id, district, postal_code, country_id
FROM address AS ad
INNER JOIN city AS ci
ON  ad.city_id = ci.city_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[(56, 'Galicia', '4166', 87),
 (105, 'Asir', '77459', 82),
 (457, 'Abu Dhabi', '41136', 101),
 (491, 'Coahuila de Zaragoza', '8268', 60),
 (332, 'Adana', '33463', 97),
 (397, 'Addis Abeba', '27796', 31),
 (214, 'Aden', '99405', 107),
 (372, 'Andhra Pradesh', '2738', 44),
 (302, 'Maharashtra', '4085', 44),
 (580, 'Tokyo-to', '33384', 50)]

and finally the  `join` to the `customer` table

In [48]:
%%sql

SELECT customer_id, first_name, last_name, email, district, postal_code, city_id
FROM customer AS cu
INNER JOIN address AS ad
ON cu.address_id = ad.address_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[(1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 'Nagasaki', '35200', 463),
 (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 'California', '17886', 449),
 (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 'Attika', '83579', 38),
 (4, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', 'Mandalay', '53561', 349),
 (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', 'Nantou', '42399', 361),
 (6, 'Jennifer', 'Davis', 'jennifer.davis@sakilacustomer.org', 'Texas', '18743', 295),
 (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', 'Central Serbia', '93896', 280),
 (8, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', 'Hamilton', '77948', 200),
 (9, 'Margaret', 'Moore', 'margaret.moore@sakilacustomer.org', 'Masqat', '45844', 329),
 (10, 'Dorothy', 'Taylor', 'dorothy.taylor@sakilacustomer.org', 'Esfahan', '53628', 162)]

Now we can start joining them all together

In [51]:
%%sql

SELECT city, country, address, district, postal_code, phone
FROM (city AS ci INNER JOIN country AS co ON ci.country_id = co.country_id)
INNER JOIN address AS ad
ON ad.city_id = ci.city_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[('A Corua (La Corua)', 'Spain', '939 Probolinggo Loop', 'Galicia', '4166', '680428310138'),
 ('Abha', 'Saudi Arabia', '733 Mandaluyong Place', 'Asir', '77459', '196568435814'),
 ('Abu Dhabi', 'United Arab Emirates', '535 Ahmadnagar Manor', 'Abu Dhabi', '41136', '985109775584'),
 ('Acua', 'Mexico', '1789 Saint-Denis Parkway', 'Coahuila de Zaragoza', '8268', '936806643983'),
 ('Adana', 'Turkey', '663 Baha Blanca Parkway', 'Adana', '33463', '834418779292'),
 ('Addis Abeba', 'Ethiopia', '614 Pak Kret Street', 'Addis Abeba', '27796', '47808359842'),
 ('Aden', 'Yemen', '751 Lima Loop', 'Aden', '99405', '756460337785'),
 ('Adoni', 'India', '230 Urawa Drive', 'Andhra Pradesh', '2738', '166898395731'),
 ('Ahmadnagar', 'India', '922 Vila Velha Loop', 'Maharashtra', '4085', '510737228015'),
 ('Akishima', 'Japan', '923 Tangail Boulevard', 'Tokyo-to', '33384', '315528269898')]

In [53]:
%%sql

SELECT cu.customer_id, cu.first_name AS customer_name, cu.last_name AS customer_lastname, cu.email, ad.address, ad.district, ad.postal_code, ad.phone, ci.city, co.country 
FROM ((city AS ci INNER JOIN country AS co ON ci.country_id = co.country_id)
INNER JOIN address AS ad ON ad.city_id = ci.city_id)
INNER JOIN customer AS cu
ON ad.address_id = cu.address_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[(1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', '28303384290', 'Sasebo', 'Japan'),
 (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', '838635286649', 'San Bernardino', 'United States'),
 (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', '448477190408', 'Athenai', 'Greece'),
 (4, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', '705814003527', 'Myingyan', 'Myanmar'),
 (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', '10655648674', 'Nantou', 'Taiwan'),
 (6, 'Jennifer', 'Davis', 'jennifer.davis@sakilacustomer.org', '1795 Santiago de Compostela Way', 'Texas', '18743', '860452626434', 'Laredo', 'United States'),
 (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', '900 Santiago de Compostela Parkway', 'Central Serbia', '93896', '716571220373', 'Kragujevac', 'Yugoslavia'),
 (8, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', '478 Joliet Way', 'Hamilton', '77948', '657282285970', 'Hamilton', 'New Zealand'),
 (9, 'Margaret', 'Moore', 'margaret.moore@sakilacustomer.org', '613 Korolev Drive', 'Masqat', '45844', '380657522649', 'Masqat', 'Oman'),
 (10, 'Dorothy', 'Taylor', 'dorothy.taylor@sakilacustomer.org', '1531 Sal Drive', 'Esfahan', '53628', '648856936185', 'Esfahan', 'Iran')]

In [54]:
%%sql

SELECT cu.customer_id, cu.first_name, cu.last_name, cu.email, ad.address, ad.district, ad.postal_code, ci.city, co.country
FROM (address AS ad INNER JOIN (city AS ci INNER JOIN country AS co ON ci.country_id = co.country_id)
ON  ad.city_id = ci.city_id)
INNER JOIN customer AS cu
ON cu.address_id = ad.address_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[(1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', 'Nagasaki', '35200', 'Sasebo', 'Japan'),
 (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', 'California', '17886', 'San Bernardino', 'United States'),
 (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', '692 Joliet Street', 'Attika', '83579', 'Athenai', 'Greece'),
 (4, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', 'Mandalay', '53561', 'Myingyan', 'Myanmar'),
 (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', 'Nantou', '42399', 'Nantou', 'Taiwan'),
 (6, 'Jennifer', 'Davis', 'jennifer.davis@sakilacustomer.org', '1795 Santiago de Compostela Way', 'Texas', '18743', 'Laredo', 'United States'),
 (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', '900 Santiago de Compostela Parkway', 'Central Serbia', '93896', 'Kragujevac', 'Yugoslavia'),
 (8, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', '478 Joliet Way', 'Hamilton', '77948', 'Hamilton', 'New Zealand'),
 (9, 'Margaret', 'Moore', 'margaret.moore@sakilacustomer.org', '613 Korolev Drive', 'Masqat', '45844', 'Masqat', 'Oman'),
 (10, 'Dorothy', 'Taylor', 'dorothy.taylor@sakilacustomer.org', '1531 Sal Drive', 'Esfahan', '53628', 'Esfahan', 'Iran')]

Now let's do the same for the films

In [59]:
%%sql 

SELECT fi.film_id, fi.title, fi.description, fi.length, ca.name AS category, ac.first_name AS actor_name, ac.last_name AS actor_lastname
FROM (((actor AS ac INNER JOIN film_actor AS fa ON ac.actor_id = fa.actor_id)
INNER JOIN film AS fi ON fa.film_id = fi.film_id)
INNER JOIN film_category AS fc ON fi.film_id = fc.film_id)
INNER JOIN category AS ca
ON fc.category_id = ca.category_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[(1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 86, 'Documentary', 'Penelope', 'Guiness'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 86, 'Documentary', 'Christian', 'Gable'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 86, 'Documentary', 'Lucille', 'Tracy'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 86, 'Documentary', 'Sandra', 'Peck'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 86, 'Documentary', 'Johnny', 'Cage'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 86, 'Documentary', 'Mena', 'Temple'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 86, 'Documentary', 'Warren', 'Nolte'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 86, 'Documentary', 'Oprah', 'Kilmer'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 86, 'Documentary', 'Rock', 'Dukakis'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 86, 'Documentary', 'Mary', 'Keitel')]

In [60]:
%%sql

SELECT fi.*, ac.first_name AS actor_first_name, ac.last_name AS actor_last_name, ca.name AS category
FROM (film AS fi INNER JOIN (film_actor AS fa INNER JOIN actor AS ac ON fa.actor_id = ac.actor_id)
ON  fi.film_id = fa.film_id)
INNER JOIN (film_category AS fc INNER JOIN category AS ca ON fc.category_id = ca.category_id)
ON fi.film_id = fc.film_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[(1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Penelope', 'Guiness', 'Documentary'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Christian', 'Gable', 'Documentary'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Lucille', 'Tracy', 'Documentary'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Sandra', 'Peck', 'Documentary'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Johnny', 'Cage', 'Documentary'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Mena', 'Temple', 'Documentary'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Warren', 'Nolte', 'Documentary'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Oprah', 'Kilmer', 'Documentary'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Rock', 'Dukakis', 'Documentary'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Mary', 'Keitel', 'Documentary')]

In order to `join` both datasets together we can use `inventory` and `rental`

In [61]:
%%sql

SELECT film_id, customer_id
FROM  inventory AS inv
INNER JOIN rental AS re
ON inv.inventory_id = re.inventory_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[(1, 431),
 (1, 518),
 (1, 279),
 (1, 411),
 (1, 170),
 (1, 161),
 (1, 581),
 (1, 359),
 (1, 39),
 (1, 541)]

In [63]:
%%sql

SELECT *
FROM ((((actor AS ac INNER JOIN film_actor AS fa ON ac.actor_id = fa.actor_id)
INNER JOIN film AS fi ON fa.film_id = fi.film_id) INNER JOIN film_category AS fc ON fi.film_id = fc.film_id)
INNER JOIN category AS ca ON fc.category_id = ca.category_id)
INNER JOIN (inventory AS inv INNER JOIN rental AS re ON inv.inventory_id = re.inventory_id)
ON fi.film_id = inv.film_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[(1, 'Penelope', 'Guiness', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000), 1, 1, datetime.datetime(2006, 2, 15, 10, 5, 3), 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 1, 6, datetime.datetime(2006, 2, 15, 10, 7, 9), 6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27), 1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17), 4863, datetime.datetime(2005, 7, 8, 19, 3, 15), 1, 431, datetime.datetime(2005, 7, 11, 21, 29, 15), 2, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (1, 'Penelope', 'Guiness', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000), 1, 1, datetime.datetime(2006, 2, 15, 10, 5, 3), 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 1, 6, datetime.datetime(2006, 2, 15, 10, 7, 9), 6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27), 1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17), 11433, datetime.datetime(2005, 8, 2, 20, 13, 10), 1, 518, datetime.datetime(2005, 8, 11, 21, 35, 10), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (1, 'Penelope', 'Guiness', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000), 1, 1, datetime.datetime(2006, 2, 15, 10, 5, 3), 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 1, 6, datetime.datetime(2006, 2, 15, 10, 7, 9), 6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27), 1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17), 14714, datetime.datetime(2005, 8, 21, 21, 27, 43), 1, 279, datetime.datetime(2005, 8, 30, 22, 26, 43), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (10, 'Christian', 'Gable', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000), 10, 1, datetime.datetime(2006, 2, 15, 10, 5, 3), 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 1, 6, datetime.datetime(2006, 2, 15, 10, 7, 9), 6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27), 1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17), 4863, datetime.datetime(2005, 7, 8, 19, 3, 15), 1, 431, datetime.datetime(2005, 7, 11, 21, 29, 15), 2, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (10, 'Christian', 'Gable', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000), 10, 1, datetime.datetime(2006, 2, 15, 10, 5, 3), 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 1, 6, datetime.datetime(2006, 2, 15, 10, 7, 9), 6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27), 1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17), 11433, datetime.datetime(2005, 8, 2, 20, 13, 10), 1, 518, datetime.datetime(2005, 8, 11, 21, 35, 10), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (10, 'Christian', 'Gable', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000), 10, 1, datetime.datetime(2006, 2, 15, 10, 5, 3), 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 1, 6, datetime.datetime(2006, 2, 15, 10, 7, 9), 6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27), 1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17), 14714, datetime.datetime(2005, 8, 21, 21, 27, 43), 1, 279, datetime.datetime(2005, 8, 30, 22, 26, 43), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (20, 'Lucille', 'Tracy', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000), 20, 1, datetime.datetime(2006, 2, 15, 10, 5, 3), 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 1, 6, datetime.datetime(2006, 2, 15, 10, 7, 9), 6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27), 1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17), 4863, datetime.datetime(2005, 7, 8, 19, 3, 15), 1, 431, datetime.datetime(2005, 7, 11, 21, 29, 15), 2, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (20, 'Lucille', 'Tracy', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000), 20, 1, datetime.datetime(2006, 2, 15, 10, 5, 3), 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 1, 6, datetime.datetime(2006, 2, 15, 10, 7, 9), 6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27), 1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17), 11433, datetime.datetime(2005, 8, 2, 20, 13, 10), 1, 518, datetime.datetime(2005, 8, 11, 21, 35, 10), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (20, 'Lucille', 'Tracy', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000), 20, 1, datetime.datetime(2006, 2, 15, 10, 5, 3), 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 1, 6, datetime.datetime(2006, 2, 15, 10, 7, 9), 6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27), 1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17), 14714, datetime.datetime(2005, 8, 21, 21, 27, 43), 1, 279, datetime.datetime(2005, 8, 30, 22, 26, 43), 1, datetime.datetime(2006, 2, 16, 2, 30, 53)),
 (30, 'Sandra', 'Peck', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000), 30, 1, datetime.datetime(2006, 2, 15, 10, 5, 3), 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 1, 6, datetime.datetime(2006, 2, 15, 10, 7, 9), 6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27), 1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17), 4863, datetime.datetime(2005, 7, 8, 19, 3, 15), 1, 431, datetime.datetime(2005, 7, 11, 21, 29, 15), 2, datetime.datetime(2006, 2, 16, 2, 30, 53))]

Our final join in two steps

In [ ]:
%%sql

SELECT fi.*, ac.first_name AS actor_first_name, ac.last_name AS actor_last_name, ca.name AS category, re.customer_id
FROM ((film AS fi INNER JOIN (film_actor AS fa INNER JOIN actor AS ac ON fa.actor_id = ac.actor_id)
ON  fi.film_id = fa.film_id)INNER JOIN (film_category AS fc INNER JOIN category AS ca ON fc.category_id = ca.category_id)
ON fi.film_id = fc.film_id)
INNER JOIN (inventory AS inv INNER JOIN rental AS re ON inv.inventory_id = re.inventory_id)
ON fi.film_id = inv.film_id
LIMIT 10

Finally we can join everything together, althought this looks complicated works with no issue and allow us to merge all together in one go

In [64]:
%%sql 

SELECT fi.*, ac.first_name AS actor_first_name, ac.last_name AS actor_last_name, ca.name AS category, cu.first_name AS customer_first_name, cu.last_name AS customer_last_name, cu.email AS customer_email, ad.address AS customer_address, ad.district AS customer_district, ad.postal_code AS customer_postal, ci.city AS customer_city, co.country AS customer_country
FROM (((film AS fi INNER JOIN (film_actor AS fa INNER JOIN actor AS ac ON fa.actor_id = ac.actor_id)
ON  fi.film_id = fa.film_id)INNER JOIN (film_category AS fc INNER JOIN category AS ca ON fc.category_id = ca.category_id)
ON fi.film_id = fc.film_id)
INNER JOIN (inventory AS inv INNER JOIN rental AS re ON inv.inventory_id = re.inventory_id)
ON fi.film_id = inv.film_id)
INNER JOIN ((address AS ad INNER JOIN (city AS ci INNER JOIN country AS co ON ci.country_id = co.country_id)
ON  ad.city_id = ci.city_id)
INNER JOIN customer AS cu
ON cu.address_id = ad.address_id)
ON re.customer_id = cu.customer_id
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
10 rows affected.

[(1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Penelope', 'Guiness', 'Documentary', 'Joel', 'Francisco', 'joel.francisco@sakilacustomer.org', '287 Cuautla Boulevard', 'Chuquisaca', '72736', 'Sucre', 'Bolivia'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Christian', 'Gable', 'Documentary', 'Joel', 'Francisco', 'joel.francisco@sakilacustomer.org', '287 Cuautla Boulevard', 'Chuquisaca', '72736', 'Sucre', 'Bolivia'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Lucille', 'Tracy', 'Documentary', 'Joel', 'Francisco', 'joel.francisco@sakilacustomer.org', '287 Cuautla Boulevard', 'Chuquisaca', '72736', 'Sucre', 'Bolivia'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Sandra', 'Peck', 'Documentary', 'Joel', 'Francisco', 'joel.francisco@sakilacustomer.org', '287 Cuautla Boulevard', 'Chuquisaca', '72736', 'Sucre', 'Bolivia'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Johnny', 'Cage', 'Documentary', 'Joel', 'Francisco', 'joel.francisco@sakilacustomer.org', '287 Cuautla Boulevard', 'Chuquisaca', '72736', 'Sucre', 'Bolivia'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Mena', 'Temple', 'Documentary', 'Joel', 'Francisco', 'joel.francisco@sakilacustomer.org', '287 Cuautla Boulevard', 'Chuquisaca', '72736', 'Sucre', 'Bolivia'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Warren', 'Nolte', 'Documentary', 'Joel', 'Francisco', 'joel.francisco@sakilacustomer.org', '287 Cuautla Boulevard', 'Chuquisaca', '72736', 'Sucre', 'Bolivia'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Oprah', 'Kilmer', 'Documentary', 'Joel', 'Francisco', 'joel.francisco@sakilacustomer.org', '287 Cuautla Boulevard', 'Chuquisaca', '72736', 'Sucre', 'Bolivia'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Rock', 'Dukakis', 'Documentary', 'Joel', 'Francisco', 'joel.francisco@sakilacustomer.org', '287 Cuautla Boulevard', 'Chuquisaca', '72736', 'Sucre', 'Bolivia'),
 (1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17", 'Mary', 'Keitel', 'Documentary', 'Joel', 'Francisco', 'joel.francisco@sakilacustomer.org', '287 Cuautla Boulevard', 'Chuquisaca', '72736', 'Sucre', 'Bolivia')]

Now we can save our result in a Pandas Dataframe

In [65]:
result = %sql SELECT fi.*, ac.first_name AS actor_first_name, ac.last_name AS actor_last_name, ca.name AS category, re.customer_id FROM ((film AS fi INNER JOIN (film_actor AS fa INNER JOIN actor AS ac ON fa.actor_id = ac.actor_id) ON  fi.film_id = fa.film_id)INNER JOIN (film_category AS fc INNER JOIN category AS ca ON fc.category_id = ca.category_id) ON fi.film_id = fc.film_id) INNER JOIN (inventory AS inv INNER JOIN rental AS re ON inv.inventory_id = re.inventory_id) ON fi.film_id = inv.film_id

df = result.DataFrame()

 * postgresql://postgres:***@localhost/dvdrental
   sqlite:///data/zoo.sqlite
87980 rows affected.

In [66]:
df.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext,actor_first_name,actor_last_name,category,customer_id
0,333,Freaky Pocus,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,2.99,126,16.99,R,2013-05-26 14:50:58.951,"[Trailers, Behind the Scenes]",'chase':17 'chef':11 'crocodil':14 'documentar...,Fay,Winslet,Music,459
1,333,Freaky Pocus,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,2.99,126,16.99,R,2013-05-26 14:50:58.951,"[Trailers, Behind the Scenes]",'chase':17 'chef':11 'crocodil':14 'documentar...,Kevin,Garland,Music,459
2,333,Freaky Pocus,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,2.99,126,16.99,R,2013-05-26 14:50:58.951,"[Trailers, Behind the Scenes]",'chase':17 'chef':11 'crocodil':14 'documentar...,Sidney,Crowe,Music,459
3,333,Freaky Pocus,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,2.99,126,16.99,R,2013-05-26 14:50:58.951,"[Trailers, Behind the Scenes]",'chase':17 'chef':11 'crocodil':14 'documentar...,Matthew,Leigh,Music,459
4,333,Freaky Pocus,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,2.99,126,16.99,R,2013-05-26 14:50:58.951,"[Trailers, Behind the Scenes]",'chase':17 'chef':11 'crocodil':14 'documentar...,Tom,Miranda,Music,459

Optionally, you can create an engine for later use using `sqlalchemy`'s `create_engine`

In [67]:
from sqlalchemy import create_engine

engine = create_engine('postgresql://postgres:trialpostgres@localhost/dvdrental')

This allows you to store SQL queries results directly in a pandas DataFrame by using [`pd.read_sql()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql.html)

In [68]:
query = """SELECT fi.*, ac.first_name AS actor_first_name, ac.last_name AS actor_last_name, ca.name AS category, cu.first_name AS customer_first_name, cu.last_name AS customer_last_name, cu.email AS customer_email, ad.address AS customer_address, ad.district AS customer_district, ad.postal_code AS customer_postal, ci.city AS customer_city, co.country AS customer_country
FROM (((film AS fi INNER JOIN (film_actor AS fa INNER JOIN actor AS ac ON fa.actor_id = ac.actor_id)
ON  fi.film_id = fa.film_id)INNER JOIN (film_category AS fc INNER JOIN category AS ca ON fc.category_id = ca.category_id)
ON fi.film_id = fc.film_id)
INNER JOIN (inventory AS inv INNER JOIN rental AS re ON inv.inventory_id = re.inventory_id)
ON fi.film_id = inv.film_id)
INNER JOIN ((address AS ad INNER JOIN (city AS ci INNER JOIN country AS co ON ci.country_id = co.country_id)
ON  ad.city_id = ci.city_id)
INNER JOIN customer AS cu
ON cu.address_id = ad.address_id)
ON re.customer_id = cu.customer_id"""

In [69]:
import pandas as pd

In [70]:
df_result = pd.read_sql(query, engine)

df_result.head(4)

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,...,actor_last_name,category,customer_first_name,customer_last_name,customer_email,customer_address,customer_district,customer_postal,customer_city,customer_country
0,333,Freaky Pocus,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,2.99,126,16.99,R,...,Winslet,Music,Tommy,Collazo,tommy.collazo@sakilacustomer.org,76 Kermanshah Manor,Esfahan,23343,Qomsheh,Iran
1,333,Freaky Pocus,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,2.99,126,16.99,R,...,Garland,Music,Tommy,Collazo,tommy.collazo@sakilacustomer.org,76 Kermanshah Manor,Esfahan,23343,Qomsheh,Iran
2,333,Freaky Pocus,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,2.99,126,16.99,R,...,Crowe,Music,Tommy,Collazo,tommy.collazo@sakilacustomer.org,76 Kermanshah Manor,Esfahan,23343,Qomsheh,Iran
3,333,Freaky Pocus,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,7,2.99,126,16.99,R,...,Leigh,Music,Tommy,Collazo,tommy.collazo@sakilacustomer.org,76 Kermanshah Manor,Esfahan,23343,Qomsheh,Iran

## Exporting files

Have you wondered how to export files for customers?. Well this is done by using the Pandas functions [`to_csv`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html) and [`to_excel`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_excel.html#pandas.DataFrame.to_excel)

### `to_csv`

In [71]:
df.to_csv('films.csv', encoding='utf-8')

### `to_excel`

In [72]:
df.to_excel('films.xlsx')

# Recap - full query syntax

Now we've completed our discussion of query syntax, here are **all** the different components of a `SELECT` query, the order in which they must appear, and whether they are required or optional <br>

| Order | Keyword | Specifies | Required? |
| --- | --- |--- | --- |
| 1 | SELECT | Column to query | Yes |
| 2 | AS | Column alias | No |
| 3 | FROM | Table to query |  Yes |
| 4 | WHERE | Row-level filter | No |
| 5 | GROUP BY| Grouping for aggregates | No |
| 6 | HAVING | Group-level filter | No |
| 7 | ORDER BY | Sort order | No |
| 8 | LIMIT | How many records to return | No |

## Useful mnemonic for order of SQL

| Keyword | Mnemonic |
| --- | --- |
| SELECT | So |
| FROM | Few |
| WHERE | Workers
| GROUP BY| Go
| HAVING | Home
| ORDER BY | On Time

## Additional resources

If you want further information about SQL, you can visit the [W3School](https://www.w3schools.com/sql/default.asp) tutorial where you can find all functions and explanations possible